Glass.Data/Web References/wsPMSNFeStatus/NFeStatusServico4.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="NFeStatusServico4" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://nfe.fazenda.ms.gov.br:443/ws/NFeStatusServico4?xsd=1" namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeStatusServico4" />
    </xsd:schema>
    <xsd:schema>
      <xsd:import schemaLocation="https://nfe.fazenda.ms.gov.br:443/ws/NFeStatusServico4?xsd=2" namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4" />
    </xsd:schema>
  </types>
  <message name="nfeStatusServicoNF">
    <part name="nfeDadosMsg" element="tns:nfeDadosMsg" />
  </message>
  <message name="nfeStatusServicoNFResponse">
    <part name="nfeResultMsg" element="tns:nfeResultMsg" />
  </message>
  <portType name="NFeStatusServicoSoap">
    <operation name="nfeStatusServicoNF">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF" message="tns:nfeStatusServicoNF" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/NFeStatusServicoSoap/nfeStatusServicoNFResponse" message="tns:nfeStatusServicoNFResponse" />
    </operation>
  </portType>
  <binding name="nfeStatusServicoSoap12Binding" type="tns:NFeStatusServicoSoap">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="nfeStatusServicoNF">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeStatusServico4/nfeStatusServicoNF" />
      <input>
        <soap12:body use="literal" />
      </input>
      <output>
        <soap12:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="NFeStatusServico4">
    <port name="nfeStatusServicoSoap12" binding="tns:nfeStatusServicoSoap12Binding">
      <soap12:address location="https://nfe.fazenda.ms.gov.br:443/ws/NFeStatusServico4" />
    </port>
  </service>
</definitions>